Cases/RANS_builtin/constant/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          thermophysicalTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



RAS
{
    model           FickianEddyDiffusivity;

    mixtureDiffusionCoefficients no;

    Prt             0.7;
    Sct             0.7;

    D // [m^2/s]
    {
      #include "transportProperties"
    }
}

// ************************************************************************* //
