Cases/RANS_builtin/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {

        type            totalPressure;
        p0              $internalField;

        type            waveTransmissive;
        field           p;
        pis             thermo:psi;
        gamma           1.4;
        fieldInf        101325;
        lInf            1;
        value           $internalField;

        // type            fixedValue;
        // value           uniform 101325;
    }
    wall
    {
        type            empty;
    }
}

// ************************************************************************* //
